/**
 * @description 六十甲子
 * @author 阿怪
 * @date 2024/1/7 04:03
 * @version v1.0.0
 *
 * 江湖的业务千篇一律，复杂的代码好几百行。
 */

// 天干 甲、乙、丙、丁、戊、己、庚、辛、壬、癸
// const TianGan = ['甲','乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
// 地支 子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥
// const DiZhi = ['子','丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉','戌', '亥'];

export const LiuShiJiaZi = [
  '甲子','乙丑','丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉',
  '甲戌','乙亥','丙子','丁丑','戊寅','己卯','庚辰','辛巳','壬午','癸未',
  '甲申','乙酉','丙戌','丁亥','戊子','己丑','庚寅','辛卯','壬辰','癸巳',
  '甲午','乙未','丙申','丁酉','戊戌','己亥','庚子','辛丑','壬寅','癸卯',
  '甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥','壬子','癸丑',
  '甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥'
];


export const yearToJiaZi = (year: number) => {
  const index = (year - 4) % 60;
  return LiuShiJiaZi[index];
}
